SkyRocketToys/STM8TX/lib/beken.c
/* Statistics about the radio */
typedef struct RadioStats_s {
	uint32_t numTxPackets; // Number of packets we have told the Beken chip to send
	uint32_t numRxPackets; // Number of packets the Beken chip says it has received
	uint32_t numTelemPackets; // Number of telemetry packets received
	uint32_t numSentPackets; // Number of packets that the Beken chip acknowledges sending
	uint32_t recvTimestampMs;
	uint32_t lastTelemetryPktTime;
	uint16_t lastTxPacketCount;
	uint8_t lastRxLen;
	uint8_t badRxAddress;
} RadioStats;

/** Parameters used by the fcc pretests */
typedef struct FccParams_s {
    bool test_mode; ///< true iff we are sending test signals
    bool scan_mode; ///< true for scanning, false for fixed frequencies
	bool CW_mode; ///< true for carrier wave, false for packets
    uint8_t scan_count; ///< In scan mode, packet count before incrementing scan
    uint8_t channel; ///< Current frequency 8..70
    uint8_t power; ///< Current power 0..7
} FccParams;

typedef struct RadioInfo_s {
	RadioStats stats;
	RadioStats last_stats;
	FccParams fcc;
    uint8_t telem_pps;
    uint8_t send_pps;
	// Radio parameters
	uint16_t bind_packets;
	uint8_t lastTxChannel; // 0..CHANNEL_COUNT_LOGICAL * CHANNEL_NUM_TABLES * CHANNEL_DWELL_PACKETS
	uint8_t lastTxPower; // 0..7
	bool lastTxCwMode; // 0=packet, 1=carrier wave
	uint8_t TX0_Address[5]; // Base address of ctrl tx
	uint8_t TX1_Address[5]; // Base address of binding tx
	uint8_t RX0_Address[5]; // Base address of telemetry/dfu rx
	uint8_t RX1_Address[5]; // ditto
	// Data to send to the drone
	packetFormatTx pktDataTx; // Packet data to send
	// Data received from the drone. See also t_status
	uint8_t bFreshData; // Have we received a packet since we last processed one
	packetFormatRx pktDataRecv; // Packet data in process of being received
	packetFormatRx pktDataRx; // Last valid packet that has been received
	uint8_t lastDroneid[SZ_CRC_GUID]; // CRC of the drone
} RadioInfo;

RadioInfo beken;
struct telem_status t_status;

// ----------------------------------------------------------------------------
uint8_t beken_get_tx_channel(void) { return beken.lastTxChannel; }

// ----------------------------------------------------------------------------
/** Kick the independant windowed watchdog so that it does not reset the CPU by timing out */
void IWDG_Kick(void)
{
#if SUPPORT_WATCHDOG
	IWDG->KR = IWDG_KEY_REFRESH; // Kick the watchdog so we don't reset
#endif
}


// -----------------------------------------------------------------------------
/** Write a single byte command to the SPI bus (e.g. Flush) */
void SPI_Write_Cmd(
	uint8_t reg) ///< The simple command to write #BK_SPI_CMD_e
{
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_write(1, &reg);
	spi_force_chip_select(false); // CSN high again
}

// ----------------------------------------------------------------------------
/** Writes value 'value' to register 'reg' */
void SPI_Write_Reg(
	uint8_t reg,  ///< The command to write #BK_SPI_CMD_e
	uint8_t value) ///< The data value to write
{
	uint8_t tx[2];
	tx[0] = reg; // For actual registers, the caller must add BK_WRITE_REG flag to reg.
	tx[1] = value;
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_write(2, &tx[0]);
	spi_force_chip_select(false); // CSN high again
}

// ----------------------------------------------------------------------------
/** Read the status from the BK2425 */
uint8_t SPI_Read_Status(void)
{
	uint8_t tx = BK_NOP;
	uint8_t rx = 0;
	spi_force_chip_select(true); // CSN low, init SPI transaction
    spi_transfer(1, &tx, &rx);
	spi_force_chip_select(false); // CSN high again
	return rx; // return register value
}

// ----------------------------------------------------------------------------
/** Read one uint8_t from BK2425 register 'reg' via SPI
\return The register value */
uint8_t SPI_Read_Reg(
	uint8_t reg)  ///< The command to write #BK_SPI_CMD_e
{
	uint8_t tx[2];
	uint8_t rx[2];
	tx[0] = reg;
	tx[1] = 0;
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_transfer(2, &tx[0], &rx[0]); // Select register to read from..
	spi_force_chip_select(false); // CSN high again
	return rx[1]; // return register value
}

// ----------------------------------------------------------------------------
/** Writes contents of a buffer to BK2425 via SPI */
void SPI_Write_Buf(
	uint8_t reg,   ///< The command to write #BK_SPI_CMD_e
	const uint8_t *pBuf,  ///< The data to write
	uint8_t length) ///< The length in bytes of the data to write
{
	spi_force_chip_select(true);
	spi_write(1, &reg);
	spi_write(length, pBuf);
	spi_force_chip_select(false);
}

// ----------------------------------------------------------------------------
// Frequency hopping
// ----------------------------------------------------------------------------

uint8_t gChannelIdxMin = 0;
uint8_t gChannelIdxMax = CHANNEL_COUNT_LOGICAL * 1 /* CHANNEL_NUM_TABLES */ * CHANNEL_DWELL_PACKETS;
uint8_t gCountdown = 0; // For counting down to changing wifi table
uint8_t gCountdownTable = 0;
uint8_t gLastWifiChannel = 0;

const uint8_t channelTable[CHANNEL_NUM_TABLES*CHANNEL_COUNT_LOGICAL] = {
#if 0
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
#else
	46,41,31,52,36,13,72,69, 21,56,16,26,61,66,10,45, // Normal
	57,62,67,72,58,63,68,59, 64,69,60,65,70,61,66,71, // Wifi channel 1,2,3,4,5
	62,10,67,72,63,68,11,64, 69,60,65,70,12,61,66,71, // Wifi channel 6
	10,67,11,72,12,68,13,69, 14,65,15,70,16,66,17,71, // Wifi channel 7
	10,70,15,20,11,71,16,21, 12,17,22,72,13,18,14,19, // Wifi channel 8
	10,15,20,25,11,16,21,12, 17,22,13,18,23,14,19,24, // Wifi channel 9,10,11
#endif
};


// ----------------------------------------------------------------------------
/** Set the range of the channel indexes we are using
\return true if we changed something */
bool SetChannelRange(
	uint8_t min, ///< The minimum logical channel range
	uint8_t max) ///< The maximum logical channel range
{
	min *= CHANNEL_DWELL_PACKETS;
	max *= CHANNEL_DWELL_PACKETS;
	if ((gChannelIdxMin != min) || (gChannelIdxMax != max))
	{
		gChannelIdxMin = min;
		gChannelIdxMax = max;
		return true;
	}
	return false;
}

// ----------------------------------------------------------------------------
/** Convert a logical channel index into a physical channel
\return The physical channel, in MHz above 2400Mhz. */
uint8_t LookupChannel(
	uint8_t idx) ///< The logical channel, as an index into a frequency hopping table.
{
	return channelTable[idx / CHANNEL_DWELL_PACKETS];
}

// ----------------------------------------------------------------------------
/** Channel hopping algorithm implementation.
	Calculate the next channel to use for transmission and change to it
	\return The next value of the logical channel index. */
uint8_t NextChannelIndex(
	uint8_t seq) ///< The current value of the logical channel index
{
	if (gCountdown)
	{
		if (--gCountdown == 0)
		{
			SetChannelRange(gCountdownTable, gCountdownTable + CHANNEL_COUNT_LOGICAL);
			seq = gCountdownTable;
			printf("Switched to table %d\r\n", gCountdownTable);
			return seq;
		}
	}
	{
		++seq;
		if (seq >= gChannelIdxMax)
			seq = gChannelIdxMin;
		else if (seq < gChannelIdxMin)
			seq = gChannelIdxMin;
	}
	return seq;
}

// ----------------------------------------------------------------------------
// Beken higher level functions
// ----------------------------------------------------------------------------


// ----------------------------------------------------------------------------
/** Switch the Beken radio to Rx mode */
void BK2425_SwitchToRxMode(void)
{
	uint8_t value;

	SPI_Write_Cmd(BK_FLUSH_RX); // flush Rx
 	value = SPI_Read_Status(); // read register STATUS's value
	SPI_Write_Reg(BK_WRITE_REG | BK_STATUS, value); // clear RX_DR or TX_DS or MAX_RT interrupt flag

	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
	value = SPI_Read_Reg(BK_CONFIG);	// read register CONFIG's value
	value |= BK_CONFIG_PRIM_RX; // set bit 0
	value |= BK_CONFIG_PWR_UP;
	SPI_Write_Reg(BK_WRITE_REG | BK_CONFIG, value); // Set PWR_UP bit, enable CRC(2 length) & Prim:RX. RX_DR enabled..

	BEKEN_CE_HIGH();
	BEKEN_PA_LOW();
}

// ----------------------------------------------------------------------------
/** Switch the Beken radio to Tx mode */
void BK2425_SwitchToTxMode(void)
{
	uint8_t value;
	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx

	BEKEN_PA_HIGH();
	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
	value = SPI_Read_Reg(BK_CONFIG); // read register CONFIG's value
	value &= ~BK_CONFIG_PRIM_RX; // Clear bit 0 (PTX)
	value |= BK_CONFIG_PWR_UP;

