SkyRocketToys/STM8TX/lib/beken.c
	return returnValue;
}

// ----------------------------------------------------------------------------
/** Read FIFO to read a packet
	\returns 0 if no packet, 1 if packet read */
uint8_t Receive_Packet(
	uint8_t rx_buf[]) ///< The buffer to fill
{
	uint8_t len, sta, fifo_sta, returnVal;
	returnVal = 0;
	sta = SPI_Read_Reg(BK_STATUS); // read register STATUS's value
	if (sta & BK_STATUS_RX_DR) // if receive data ready (RX_DR) interrupt
	{
		do
		{
			beken.stats.numRxPackets++;
			len = SPI_Read_Reg(BK_R_RX_PL_WID_CMD);	// read received packet length in bytes
			beken.stats.lastRxLen = len;

			if (len <= PACKET_LENGTH_RX_MAX)
			{
				// This includes short packets (e.g. where no telemetry was sent)
				spi_read_registers(BK_RD_RX_PLOAD, rx_buf, len); // read receive payload from RX_FIFO buffer
				returnVal = 1;
			}
			else // Packet was too long
			{
				SPI_Write_Cmd(BK_FLUSH_RX); // flush Rx
			}
			fifo_sta = SPI_Read_Reg(BK_FIFO_STATUS);	// read register FIFO_STATUS's value
		} while (!(fifo_sta & BK_FIFO_STATUS_RX_EMPTY)); // while not empty
	}
	SPI_Write_Reg(BK_WRITE_REG | BK_STATUS,
		(BK_STATUS_RX_DR | BK_STATUS_TX_DS | BK_STATUS_MAX_RT)); // clear RX_DR or TX_DS or MAX_RT interrupt flag
	return returnVal;
}

// ----------------------------------------------------------------------------
/** Flush the Beken radio TX buffer */
void FlushTx(void)
{
	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx
}

// ----------------------------------------------------------------------------
/** Get the Beken radio chip ID
	\return BK_CHIP_ID_BK2425 */
uint8_t Get_Chip_ID(void)
{
	uint8_t ReadArr[4];
	SPI_Bank1_Read_Reg(BK2425_R1_WHOAMI, ReadArr);
	return ReadArr[0];
}

// ----------------------------------------------------------------------------
/** Ensure that the chip id is good */
void VerifyBekenChipID(void)
{
	uint8_t id = Get_Chip_ID();
#if SUPPORT_UART
	printf("\r\n# Chip ID: %u\r\n", id);
#endif
	while (id != BK_CHIP_ID_BK2425)
	{
#if SUPPORT_UART
		printf("Chip ID Failed: %u\r\n", id);
#endif
		IWDG_Kick();
		initBeken();
		delay_ms(200);
		id = Get_Chip_ID();
	}
}


// ----------------------------------------------------------------------------
// Interface expected by main program
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
/** Initialise the Beken radio chip */
void beken_init(void)
{
	// Initialise the firmware data
	uint32_t crc = crc_crc32((const uint8_t *)0x8700, (0xc000-0x8700));
	gFwInfo[BK_INFO_FW_CRC_LO] = crc & 0xffff;
	gFwInfo[BK_INFO_FW_CRC_HI] = (crc >> 16) & 0xffff;
	gFwInfo[BK_INFO_FW_VER] = 0;
	gFwInfo[BK_INFO_DFU_RX] = 0;
	gFwInfo[BK_INFO_FW_YM] = 0;
	gFwInfo[BK_INFO_FW_DAY] = 0;
	gFwInfo[BK_INFO_MODEL] = 1;
	gFwInfo[BK_INFO_PPS] = 0; // ... needs to be updated over time
	gFwInfo[BK_INFO_BATTERY] = 0; // Will be updated over time
	gFwInfo[BK_INFO_COUNTDOWN] = 0; // Will be updated over time

	// Setup the Beken chip. Assumes that SPI is initialised by now
	delay_ms(10);
	initBeken();
	IWDG_Kick();
	delay_ms(200);

	VerifyBekenChipID();
	IWDG_Kick();
	switch (BK2425_GetSpeed()) { // Use the default speed
	case 250: BK2425_Initialize(ITX_250); break;
	case 1000: BK2425_Initialize(ITX_1000); break;
	case 2000: BK2425_Initialize(ITX_2000); break;
	}
	// Should now be in Rx mode
	// Configure radio interrupt
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP_IRQ);
	BK2425_SwitchToRxMode();
}

// ----------------------------------------------------------------------------
void ProcessPacket(packetFormatRx* rx, uint8_t rxstd)
{
	if (rx->packetType == BK_PKT_TYPE_TELEMETRY)
	{
		uint8_t tx;
		uint8_t wifi;
		beken.stats.lastTelemetryPktTime = timer_get_ms();
		beken.stats.numTelemPackets++;

		// Should we change channel table due to Wi-Fi changes?
		tx = 0;
		wifi = rx->wifi;
		while (wifi >= 24*4)
		{
			wifi -= 24*4;
			tx += 4;
		}
		while (wifi >= 24) // Argh, avoid DIV instruction within an interrupt on STM8
		{
			wifi -= 24;
			++tx;
		}
		if (wifi != gLastWifiChannel)
		{
			uint8_t wanted = 0;
			gLastWifiChannel = wifi;
			switch (rx->wifi) {
			case 0: wanted = 0; break;
			case 1: case 2: case 3: case 4: case 5: wanted = 1; break;
			case 6: wanted = 2; break;
			case 7: wanted = 3; break;
			case 8: wanted = 4; break;
			default: wanted = 5; break;
			}
			gCountdown = 10;
			gCountdownTable = wanted * CHANNEL_COUNT_LOGICAL;
		}
		// Remember the data for later. Process that in the main thread
		t_status.flags = rx->flags;
		{
			uint8_t i;
			for (i = 0; i < SZ_CRC_GUID; ++i)
				beken.lastDroneid[i] = rx->droneid[i];
		}
		t_status.flight_mode = rx->flight_mode;
		t_status.wifi_chan = wifi;
		t_status.tx_max = tx;
		t_status.note_adjust = rx->note_adjust;
	}
	else if (rx->packetType == BK_PKT_TYPE_DFU)
	{
		const packetFormatDfu* pDFU = (const packetFormatDfu*) rx;
		uint16_t addr = (pDFU->address_hi << 8) | pDFU->address_lo;
		uint8_t* dst = (uint8_t*) addr;
		memcpy(&dfu_buffer[addr & 0x70], pDFU->data, 16);
		if (addr == 0)
		{
			// Check to see if the EEPROM is new
			//...
			// Erase the EEPROM
			//...
		}
		if ((addr & 0x7f) == 0x70) // End of a page
		{
			// Fast write the buffer to the flash
			//...
//			memcpy(dst, dfu_buffer, 0x80);
		}
		//...
	}
}

// ----------------------------------------------------------------------------
/** The IRQ routine that needs to be called on radio interrupts for the Beken chip */
void beken_irq(void)
{
	// Determine which state fired the interrupt
	uint8_t bk_sta = SPI_Read_Reg(BK_STATUS);
	if (bk_sta & BK_STATUS_TX_DS)
	{
		// Packet was sent successfully (not yet acknowledged)
		beken.stats.numSentPackets++;
		BK2425_SwitchToRxMode(); // Prepare to receive reply
	}
	if (bk_sta & BK_STATUS_MAX_RT)
	{
		// We have had a "max retries" error
	}
	if (bk_sta & BK_STATUS_RX_DR)
	{
		// We have received a packet
		uint8_t rxstd = 0;
		// Which pipe (address) have we received this packet on?
		if ((bk_sta & BK_STATUS_RX_MASK) == BK_STATUS_RX_P_0)
		{
			rxstd = 0;
		}
		else
		{
			beken.stats.badRxAddress++;
		}
		beken.bFreshData = 1;
		Receive_Packet((uint8_t *)&beken.pktDataRecv);
		memcpy(&beken.pktDataRx, &beken.pktDataRecv, sizeof(beken.pktDataRx));
		ProcessPacket(&beken.pktDataRx, rxstd);
	}

